OldTests/Linux-VitBox/benchmark_raw_20260415_161037/raw_logs/fio_seq_rw_raw.txt
seq_rw: (g=0): rw=rw, bs=(R) 1024KiB-1024KiB, (W) 1024KiB-1024KiB, (T) 1024KiB-1024KiB, ioengine=psync, iodepth=8
fio-3.39
Starting 1 process
note: both iodepth >= 1 and synchronous I/O engine are selected, queue depth will be capped at 1

seq_rw: (groupid=0, jobs=1): err= 0: pid=1161: Wed Apr 15 16:21:21 2026
  read: IOPS=116, BW=117MiB/s (122MB/s)(7009MiB/60002msec)
    clat (usec): min=1266, max=78387, avg=6501.14, stdev=5111.76
     lat (usec): min=1267, max=78388, avg=6502.17, stdev=5111.76
    clat percentiles (usec):
     |  1.00th=[ 2540],  5.00th=[ 2671], 10.00th=[ 3556], 20.00th=[ 3720],
     | 30.00th=[ 3752], 40.00th=[ 3818], 50.00th=[ 3982], 60.00th=[ 4883],
     | 70.00th=[ 5800], 80.00th=[11207], 90.00th=[13829], 95.00th=[14877],
     | 99.00th=[17171], 99.50th=[23987], 99.90th=[64226], 99.95th=[73925],
     | 99.99th=[78119]
   bw (  KiB/s): min=81593, max=167936, per=99.93%, avg=119527.47, stdev=17632.43, samples=114
   iops        : min=   79, max=  164, avg=116.25, stdev=17.27, samples=114
  write: IOPS=117, BW=117MiB/s (123MB/s)(7040MiB/60002msec); 0 zone resets
    clat (usec): min=201, max=80156, avg=1974.81, stdev=3410.50
     lat (usec): min=216, max=80167, avg=2028.56, stdev=3410.10
    clat percentiles (usec):
     |  1.00th=[  262],  5.00th=[  302], 10.00th=[  627], 20.00th=[ 1123],
     | 30.00th=[ 1172], 40.00th=[ 1188], 50.00th=[ 1221], 60.00th=[ 1254],
     | 70.00th=[ 1287], 80.00th=[ 1336], 90.00th=[ 1483], 95.00th=[ 9765],
     | 99.00th=[13698], 99.50th=[15008], 99.90th=[36963], 99.95th=[65274],
     | 99.99th=[80217]
   bw (  KiB/s): min=86506, max=155648, per=100.00%, avg=120361.37, stdev=14367.85, samples=114
   iops        : min=   84, max=  152, avg=117.10, stdev=14.04, samples=114
  lat (usec)   : 250=0.16%, 500=4.83%, 750=0.11%, 1000=0.69%
  lat (msec)   : 2=40.49%, 4=24.81%, 10=15.62%, 20=12.90%, 50=0.26%
  lat (msec)   : 100=0.14%
  cpu          : usr=1.65%, sys=4.88%, ctx=14064, majf=0, minf=8
  IO depths    : 1=100.0%, 2=0.0%, 4=0.0%, 8=0.0%, 16=0.0%, 32=0.0%, >=64=0.0%
     submit    : 0=0.0%, 4=100.0%, 8=0.0%, 16=0.0%, 32=0.0%, 64=0.0%, >=64=0.0%
     complete  : 0=0.0%, 4=100.0%, 8=0.0%, 16=0.0%, 32=0.0%, 64=0.0%, >=64=0.0%
     issued rwts: total=7009,7040,0,0 short=0,0,0,0 dropped=0,0,0,0
     latency   : target=0, window=0, percentile=100.00%, depth=8

Run status group 0 (all jobs):
   READ: bw=117MiB/s (122MB/s), 117MiB/s-117MiB/s (122MB/s-122MB/s), io=7009MiB (7349MB), run=60002-60002msec
  WRITE: bw=117MiB/s (123MB/s), 117MiB/s-117MiB/s (123MB/s-123MB/s), io=7040MiB (7382MB), run=60002-60002msec

Disk stats (read/write):
  sda: ios=6972/7470, sectors=14278656/14365168, merge=0/54, ticks=44378/13524, in_queue=58075, util=94.72%